Tekla Open API Reference for Tekla Structures 2025
Seam.AutoPosition Property
 The auto position type. Defines that the seam will internally evaluate the final position more accurately. The input positions are still needed for reference.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AutoPosition { get; set; }
Public Property AutoPosition As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace